week_07/day_32/copro/app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "user_id", "created_at", "updated_at", "preview") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sample"], ["user_id", 3], ["created_at", "2018-01-24 01:47:29.692369"], ["updated_at", "2018-01-24 01:47:29.692369"], ["preview", nil]]
---
  def create
    redirect_to '/login' unless session[:user_id]
    project = Project.new
    project.title = params[:title]
    project.user_id = session[:user_id]
    project.preview = params[:preview]
    if project.save

SELECT  "projects".* FROM "projects" INNER JOIN "comments" ON "comments"."project_id" = "projects"."id" WHERE "projects"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
---
  def show
    @project = Project.joins(:comments).find_by(id: params[:id])