week_07/day_32/copro/app/views/projects/show.html.erb

  <input type="hidden" name="project_id" value="<%= @project.id %>">
  <%= @project.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."project_id" = $1  [["project_id", 28]]

  <div>
    <% @project.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."project_id" = $1  [["project_id", 27]]