week_07/day_31/rails_goofood/app/controllers/dishes_controller.rb

  def show
    dish = Dish.find_by(id: params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]